samples/src/test/resources/org/apache/axiom/samples/soap-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:q="http://example.org/quote">
   <soapenv:Body>
      <q:getQuote>
         <q:symbol>MSFT</q:symbol>
      </q:getQuote>
   </soapenv:Body>
</soapenv:Envelope>